Repository: Phu211/-DACK-PTUDDNT-MAXAHOISYNAP
Catalog: lib/l10n/app_*.arb
Languages: vi, zh

# homeTitle
source: Home
vi: Trang chủ
zh: 主页

# storiesYourStory
source: Your story
vi: Tin của bạn
zh: 你的动态

# profileTitle
source: Profile
vi: Trang cá nhân
zh: 个人主页

source: Edit profile
vi: Chỉnh sửa trang cá nhân
zh: 编辑个人主页

source: Friends
vi: Bạn bè
zh: 朋友

source: View all friends
vi: Xem tất cả bạn bè
zh: 查看所有朋友

# noPosts
source: No posts yet
vi: Chưa có bài viết nào
zh: 还没有帖子

# savedTitle
source: Saved
vi: Đã lưu
zh: 已保存

# savedEmptyTitle
source: No saved posts
vi: Chưa có bài viết nào được lưu
zh: 还没有保存的帖子

# savedEmptyDesc
source: Save posts to view them later
vi: Lưu bài viết để xem lại sau
zh: 保存帖子以便稍后查看

# languageTitle
source: Language
vi: Ngôn ngữ
zh: 语言

# languageSelectPrompt
source: Choose the app language
vi: Chọn ngôn ngữ cho ứng dụng
zh: 选择应用语言

# languageSelectDesc
source: Language change applies to the whole app
vi: Thay đổi ngôn ngữ sẽ áp dụng cho toàn bộ giao diện ứng dụng
zh: 更改语言将作用于整个应用界面

# languageAutoTranslate
source: Auto translate content
vi: Tự động dịch nội dung
zh: 自动翻译内容

# languageAutoTranslateDesc
source: Automatically translate posts and comments
vi: Tự động dịch bài viết và bình luận
zh: 自动翻译帖子和评论

# languageInfo
source: Some features might not be translated yet
vi: Một số tính năng có thể chưa được dịch
zh: 部分功能可能尚未完全翻译

source: Retry
vi: Thử lại
zh: 重试

# loginRequired
source: Please log in
vi: Vui lòng đăng nhập
zh: 请登录

# postComments
source: {count} comments
vi: {count} bình luận
zh: {count} 条评论

# postPlayVideo
source: Play video
vi: Phát video
zh: 播放视频

# postRemoveTag
source: Remove tag
vi: Gỡ thẻ
zh: 移除标签

# postRemoveTagConfirm
source: Are you sure you want to remove your tag from this post? The post will no longer appear in your "Tagged" section.
vi: Bạn có chắc chắn muốn gỡ thẻ khỏi bài viết này? Bài viết sẽ không hiển thị trong mục "Được gắn thẻ" của bạn nữa.
zh: 您确定要从此帖子中移除您的标签吗？该帖子将不再出现在您的"已标记"部分。

# postRemoveTagSuccess
source: Tag removed from post
vi: Đã gỡ thẻ khỏi bài viết
zh: 已从帖子中移除标签

# postSave
source: Save post
vi: Lưu bài viết
zh: 保存帖子

# postUnsave
source: Remove from saved items
vi: Xóa khỏi danh sách các mục đã lưu.
zh: 从已保存项目中移除

# postSaveDescription
source: Add to saved items
vi: Thêm vào danh sách các mục đã lưu.
zh: 添加到已保存项目

# postSavedSuccess
source: Post saved
vi: Đã lưu bài viết
zh: 帖子已保存

# postUnsavedSuccess
source: Post unsaved
vi: Đã bỏ lưu bài viết
zh: 帖子已取消保存

# postHiddenSuccess
source: Post hidden
vi: Đã ẩn bài viết
zh: 帖子已隐藏

# postTemporarilyHideUser
source: Temporarily hide user
vi: Tạm ẩn người dùng
zh: 临时隐藏用户

# postTemporarilyHideUserConfirm
source: Temporarily hide {name} for 30 days
vi: Tạm ẩn {name} trong 30 ngày
zh: 临时隐藏 {name} 30 天

# postTemporarilyHideUserSuccess
source: User temporarily hidden for 30 days
vi: Đã tạm ẩn người dùng trong 30 ngày
zh: 用户已临时隐藏 30 天

# postHideAllFromUser
source: Hide all posts
vi: Ẩn tất cả bài viết
zh: 隐藏所有帖子

# postHideAllFromUserConfirm
source: Hide all from {name}
vi: Ẩn tất cả từ {name}
zh: 隐藏来自 {name} 的所有内容

# postHideAllFromUserSuccess
source: All posts from this user have been hidden
vi: Đã ẩn tất cả bài viết từ người dùng này
zh: 已隐藏来自此用户的所有帖子

# postBlockUser
source: Block user
vi: Chặn người dùng
zh: 屏蔽用户

# postBlockUserConfirm
source: Block {name}'s profile
vi: Chặn trang cá nhân của {name}
zh: 屏蔽 {name} 的个人主页

# postBlockUserSuccess
source: User blocked
vi: Đã chặn người dùng
zh: 用户已屏蔽

# postDeleteSuccess
source: Post deleted
vi: Đã xóa bài viết
zh: 帖子已删除

# postShare
source: Share post
vi: Chia sẻ bài viết
zh: 分享帖子

# postShareToStory
source: Share to your story
vi: Chia sẻ lên tin của bạn
zh: 分享到您的动态

# postShareToProfile
source: Share to profile
vi: Chia sẻ lên trang cá nhân
zh: 分享到个人主页

# postShareToProfileSuccess
source: Post shared to profile
vi: Đã chia sẻ bài viết lên trang cá nhân
zh: 帖子已分享到个人主页

# postShareToStorySuccess
source: Post shared to your story
vi: Đã chia sẻ bài viết lên tin của bạn
zh: 帖子已分享到您的动态

# postTaggedUsers
source: Tagged {users}
vi: Đã gắn thẻ {users}
zh: 标记了 {users}

# timeAgoDays
source: {days} days ago
vi: {days} ngày trước
zh: {days} 天前

# timeAgoHours
source: {hours} hours ago
vi: {hours} giờ trước
zh: {hours} 小时前

# timeAgoMinutes
source: {minutes} minutes ago
vi: {minutes} phút trước
zh: {minutes} 分钟前

# timeAgoJustNow
source: Just now
vi: Vừa xong
zh: 刚刚

# postShareError
source: Cannot share post
vi: Không thể chia sẻ bài viết
zh: 无法分享帖子

# postReactionError
source: Cannot react to post
vi: Không thể bày tỏ cảm xúc
zh: 无法对帖子做出反应

# postReactionDisplayError
source: Cannot display reactions
vi: Không thể hiển thị bày tỏ cảm xúc
zh: 无法显示反应

# postNoReactions
source: No reactions yet
vi: Chưa có người nào
zh: 还没有反应

# postAllReactions
source: All reactions
vi: Tất cả cảm xúc
zh: 所有反应

# commentEdit
source: Edit comment
vi: Chỉnh sửa bình luận
zh: 编辑评论

# commentDelete
source: Delete comment
vi: Xóa bình luận
zh: 删除评论

# commentDeleteConfirm
source: Are you sure you want to delete this comment?
vi: Bạn có chắc chắn muốn xóa bình luận này?
zh: 您确定要删除此评论吗？

# commentUpdatedSuccess
source: Comment updated
vi: Đã cập nhật bình luận
zh: 评论已更新

# commentUpdateError
source: Error updating comment
vi: Lỗi cập nhật bình luận
zh: 更新评论时出错

# commentEdited
source: â€¢ Edited
vi: • Đã chỉnh sửa
zh: • 已编辑

# createPostEditTitle
source: Edit post
vi: Chỉnh sửa bài viết
zh: 编辑帖子

# createPostContentRequired
source: Please enter content or select image/video/GIF
vi: Vui lòng nhập nội dung hoặc chọn ảnh/video/GIF
zh: 请输入内容或选择图片/视频/GIF

# createPostAlbumFeature
source: Album feature is under development
vi: Tính năng album đang phát triển
zh: 相册功能正在开发中

# createPostUploadingImages
source: Uploading images...
vi: Đang tải ảnh lên...
zh: 正在上传图片...

# createPostUploadingVideo
source: Uploading video...
vi: Đang tải video lên...
zh: 正在上传视频...

# createPostProcessing
source: Processing...
vi: Đang xử lý...
zh: 正在处理...

# createPostUploadProgress
source: {percent}% Complete
vi: {percent}% Hoàn tất
zh: {percent}% 完成

# aiAssistantGetSuggestions
source: Get AI suggestions
vi: Nhận gợi ý từ AI
zh: 获取 AI 建议

# aiAssistantLoading
source: Loading...
vi: Đang tải...
zh: 加载中...

# aiAssistantTitle
source: AI Suggestions
vi: Gợi ý từ AI
zh: AI 建议

# aiAssistantCaption
source: Improved caption
vi: Caption cải thiện
zh: 改进的标题

# aiAssistantHashtags
source: Suggested hashtags
vi: Hashtags gợi ý
zh: 建议的标签

# aiAssistantTranslation
source: Translation
vi: Bản dịch
zh: 翻译

# aiAssistantSentiment
source: Sentiment analysis
vi: Phân tích cảm xúc
zh: 情感分析

# aiAssistantCaptionApplied
source: Caption applied
vi: Đã áp dụng caption
zh: 标题已应用

# aiAssistantHashtagsApplied
source: Hashtags added
vi: Đã thêm hashtags
zh: 标签已添加

# aiAssistantTranslationApplied
source: Translation applied
vi: Đã áp dụng bản dịch
zh: 翻译已应用

# aiAssistantEmptyContent
source: Please enter content or select an image to get AI suggestions
vi: Vui lòng nhập nội dung hoặc chọn ảnh để nhận gợi ý từ AI
zh: 请输入内容或选择图片以获取 AI 建议

# aiAssistantError
source: Cannot generate suggestions. Please try again.
vi: Không thể tạo gợi ý. Vui lòng thử lại.
zh: 无法生成建议。请重试。

# aiAssistantLoadError
source: Error loading AI suggestions
vi: Lỗi tải gợi ý AI
zh: 加载 AI 建议时出错
